stm32-hotspot/X-CUBE-MATTER-Extension/Projects/STM32WBA65I-DK1/Applications/Matter/Lighting-App/Core/Src/app_entry.cpp
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    app_entry.c
  * @author  MCD Application Team
  * @brief   Entry point of the application
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "app_conf.h"
#include "main.h"
#include "app_entry.h"
#include "cmsis_os2.h"
#include "stm32_rtos.h"
#include "task.h"
#if (CFG_LPM_LEVEL != 0)
#include "stm32_lpm.h"
#endif /* (CFG_LPM_LEVEL != 0) */
#include "stm32_timer.h"
#include "stm32_mm.h"
#if (CFG_LOG_SUPPORTED != 0) || (OT_CLI_USE == 1)
#include "stm32_adv_trace.h"
#include "serial_cmd_interpreter.h"
#endif /* (CFG_LOG_SUPPORTED != 0) || (OT_CLI_USE == 1)*/
#include "app_ble.h"
#include "app_thread.h"
#include "ll_sys_if.h"
#include "linklayer_plat.h"
#include "AppEvent.h"
#include "AppTask.h"
#include "app_sys.h"
#include "otp.h"
#include "scm.h"
#include "bpka.h"
#include "ll_sys.h"
#include "advanced_memory_manager.h"
#include "flash_driver.h"
#include "flash_manager.h"
#include "simple_nvm_arbiter.h"
#include "app_debug.h"
#if (USE_TEMPERATURE_BASED_RADIO_CALIBRATION == 1)
#include "adc_ctrl.h"
#include "temp_measurement.h"
#endif /* USE_TEMPERATURE_BASED_RADIO_CALIBRATION */
#include "timer_if.h"
extern "C" void xPortSysTickHandler (void); /* Redefinition of the function with C linkage */
extern "C" void vPortSetupTimerInterrupt(void); /* Redefinition of the function with C linkage */
/* Private includes -----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "app_bsp.h"
#include "stm32wba65i_discovery.h"
#include "stm32wba65i_discovery_bus.h"
#if (CFG_LCD_SUPPORTED == 1)
#include "stm32wba65i_discovery_lcd.h"
#include "stm32_lcd.h"
#endif /* CFG_LCD_SUPPORTED */
#include "stm32_lpm.h"
#if(CFG_RT_DEBUG_DTB == 1)
#include "RTDebug_dtb.h"
#endif /* CFG_RT_DEBUG_DTB */
#include "crc_ctrl.h"
#include "psa/crypto.h"
#if (OTA_SUPPORT == 1)
#if (OTA_EXTERNAL_FLASH_ENABLE == 1)
#include "stm_ota_spi_flash.h"
#else
#include "stm_ota_flash.h"
#endif /* (OTA_EXTERNAL_FLASH_ENABLE == 1) */
#endif /* (OTA_SUPPORT == 1) */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/

/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private constants ---------------------------------------------------------*/
/* USER CODE BEGIN PC */

/* USER CODE END PC */

/* Private variables ---------------------------------------------------------*/
#if ( CFG_LPM_LEVEL != 0)
static bool system_startup_done = FALSE;
/* Holds maximum number of FreeRTOS tick periods that can be suppressed */
static uint32_t maximumPossibleSuppressedTicks = 0;
#endif /* ( CFG_LPM_LEVEL != 0) */

#if (CFG_LOG_SUPPORTED != 0)
/* Log configuration */
static Log_Module_t Log_Module_Config = { .verbose_level = APPLI_CONFIG_LOG_LEVEL, .region = LOG_REGION_ALL_REGIONS };
#endif /* (CFG_LOG_SUPPORTED != 0) */

/* AMM configuration */
static uint32_t AMM_Pool[CFG_AMM_POOL_SIZE];
static AMM_VirtualMemoryConfig_t vmConfig[CFG_AMM_VIRTUAL_MEMORY_NUMBER] =
{
  /* Virtual Memory #1 */
  {
    .Id = CFG_AMM_VIRTUAL_STACK_BLE,
    .BufferSize = CFG_AMM_VIRTUAL_STACK_BLE_BUFFER_SIZE
  },
  /* Virtual Memory #2 */
  {
    .Id = CFG_AMM_VIRTUAL_APP_BLE,
    .BufferSize = CFG_AMM_VIRTUAL_APP_BLE_BUFFER_SIZE
  },
};

static AMM_InitParameters_t ammInitConfig =
{
  .p_PoolAddr = AMM_Pool,
  .PoolSize = CFG_AMM_POOL_SIZE,
  .VirtualMemoryNumber = CFG_AMM_VIRTUAL_MEMORY_NUMBER,
  .p_VirtualMemoryConfigList = vmConfig
};


/* USER CODE BEGIN PV */


/* FreeRtos Random Process stacks attributes */
const osThreadAttr_t stRandomProcessTaskAttributes = 
{
  .name = "Hw Random Task",
  .stack_size = TASK_HW_RNG_STACK_SIZE,
  .priority = CFG_TASK_PRIO_HW_RNG

};

/* FreeRtos Amm Background Task stacks attributes */
const osThreadAttr_t stAmmBckgTaskAttributes = 
{
  .name = "AMM Background Task",
  .stack_size = TASK_AMM_BCKG_STACK_SIZE,
  .priority = CFG_TASK_PRIO_AMM_BCKG
};

/* FreeRtos BPKA Background Task stacks attributes */
const osThreadAttr_t stBPKATaskAttributes = 
{
  .name = "BPKA Task",
  .stack_size = TASK_BPKA_STACK_SIZE,
  .priority = CFG_TASK_PRIO_BPKA
};

/* FreeRtos Flash Manager Background Task stacks attributes */
const osThreadAttr_t stFlashManagerBackgroundTaskAttributes = 
{
  .name = "Flash Manager Background Task",
  .stack_size = TASK_FLASH_MANAGER_BCKGND_STACK_SIZE,
  .priority = CFG_TASK_PRIO_FLASH_MANAGER_BCKGND
};

osSemaphoreId_t       BpkaSemaphore;
osThreadId_t          BpkaTaskId;

osSemaphoreId_t       AppliInitEndSemaphore, HwRngSemaphore;
osThreadId_t          AppliInitTaskId, RandomProcessTaskId;

osSemaphoreId_t       AmmBckgSemaphore, FlashMangerReqSemaphore;
osThreadId_t          AmmBckgTaskId, FmBackgroundTaskId;



static UTIL_TIMER_Object_t  TimerOStick_Id;
static UTIL_TIMER_Object_t  TimerOSwakeup_Id;
/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/
/* USER CODE BEGIN GV */

/* USER CODE END GV */

/* Private functions prototypes-----------------------------------------------*/
static void Config_HSE(void);
static void RNG_Init( void );
static void System_Init( void );
static void SystemPower_Config( void );
static void TimerOSwakeupCB(void *arg);
#if ( CFG_LPM_LEVEL != 0)
static void preOSsleepProcessing(uint32_t expectedIdleTime);
static void postOSsleepProcessing(uint32_t expectedIdleTime);
static uint32_t getCurrentTime(void);
#endif /* CFG_LPM_LEVEL */

/* Callback function to handle pushbutton to AppTask */
PushButtonCallback PbCb = NULL;

void APPE_PushButtonSetReceiveCb(PushButtonCallback aCallback)
{
	PbCb = aCallback;
}

/**
 * @brief Joystick Up Action
 *
 * @param  None
 * @return None
 */
void APP_BSP_JoystickUpAction( void )
{
	ButtonDesc_t Message;
	Message.button = B1;
	Message.State = 1;
	PbCb(&Message); //call matter callback to handle push button
}

/**
 * @brief Joystick Select Action
 *
 * @param  None
 * @return None
 */
void APP_BSP_JoystickSelectAction( void )
{
	 ButtonDesc_t Message;
	 Message.button = B2;
	 Message.State = 1;
	 PbCb(&Message); //call matter callback to handle push button
}
/**
 * @brief Wrapper for init function of the MM for the AMM
 *
 * @param p_PoolAddr: Address of the pool to use - Not use -
 * @param PoolSize: Size of the pool - Not use -
 *
 * @return None
 */
static void AMM_WrapperInit (uint32_t * const p_PoolAddr, const uint32_t PoolSize);

/**
 * @brief Wrapper for allocate function of the MM for the AMM
 *
 * @param BufferSize
 *
 * @return Allocated buffer
 */
static uint32_t * AMM_WrapperAllocate (const uint32_t BufferSize);

/**
 * @brief Wrapper for free function of the MM for the AMM
 *
 * @param p_BufferAddr
 *
 * @return None
 */
static void AMM_WrapperFree (uint32_t * const p_BufferAddr);
static void BPKA_Task(void *argument);
static void AMM_Background_Task(void *argument);
static void FM_Background_Task(void *argument);
static void HW_RNG_Process_Task(void *argument);


/* USER CODE BEGIN PFP */

#if (CFG_LOG_INSERT_TIME_STAMP_INSIDE_THE_TRACE != 0)
static void LogTimestamp(uint8_t * pData, uint16_t * piSize);
#endif /*CFG_LOG_INSERT_TIME_STAMP_INSIDE_THE_TRACE */
/* USER CODE END PFP */

