stm32-hotspot/X-CUBE-MATTER-Extension/Projects/STM32WBA65I-DK1/Applications/Matter/Lighting-App/Core/Src/app_entry.cpp
/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/
/**
 * @brief   System Initialisation.
 */
void MX_APPE_Config(void)
{
  /* Configure HSE Tuning */
  Config_HSE();
}

/**
 * @brief   Background Task for AMM.
 */
void AMM_Background_Task(void *argument)
{
  UNUSED( argument );
  while(1)
  {
    osSemaphoreAcquire(AmmBckgSemaphore, osWaitForever);
    AMM_BackgroundProcess();
    osThreadYield();
  }
}

/**
 * @brief   Background Task for Flash Manager.
 */
void FM_Background_Task(void *argument)
{
  UNUSED( argument );
  while(1)
  {
    osSemaphoreAcquire(FlashMangerReqSemaphore, osWaitForever);
    FM_BackgroundProcess();
    osThreadYield();
  }
}

/**
 * @brief   Background Task for BPKA.
 */
void BPKA_Task(void *argument)
{
  UNUSED( argument );
  while(1)
  {
    osSemaphoreAcquire(BpkaSemaphore, osWaitForever);
    osMutexAcquire(LinkLayerMutex, osWaitForever);
    BPKA_BG_Process();
    osMutexRelease(LinkLayerMutex);
    osThreadYield();
  }
}


/**
 * @brief   System Initialisation.
 */
uint32_t MX_APPE_Init(void *p_param)
{
  APP_DEBUG_SIGNAL_SET(APP_APPE_INIT);

  UNUSED(p_param);

  /* System initialization */
  System_Init();

  /* Configure the system Power Mode */
  SystemPower_Config();


  APP_DBG("FW info :\n");
  APP_DBG("**********************************************************\n");
  APP_DBG("PRODUCT NAME : " PRODUCT_NAME "\n"  );
  APP_DBG("VENDOR NAME : " VENDOR_NAME "\n" );
  #if defined(USE_STM32WBA65I_DK1) // TODO: to be checked once WBA6 DK header file released
    APP_DBG("HARDWARE : STM32WBA65MM-DK\n" );
  #elif defined(STM32WBA65xx)
   	APP_DBG("HARDWARE : STM32WBA65xx\n" );
  #else
   	APP_DBG("HARDWARE : UNSPECIFIED\n" );
  #endif
  APP_DBG("SOFTWARE : X-CUBE-MATTER release revision " X_CUBE_MATTER_VERSION "\n" );
  APP_DBG("Embedded SW components :\n");
  APP_DBG("- Matter SDK version : " MATTER_SDK_VERSION "\n" );
  APP_DBG("**********************************************************\n");

#if (USE_TEMPERATURE_BASED_RADIO_CALIBRATION == 1)
  /* Initialize the Temperature measurement */
  TEMPMEAS_Init ();
#endif /* (USE_TEMPERATURE_BASED_RADIO_CALIBRATION == 1) */

  /* Initialize the Advance Memory Manager */
  AMM_Init (&ammInitConfig);

  /* Create thread for AMM background and semaphore to control it*/
  AmmBckgSemaphore = osSemaphoreNew( 1, 0, NULL );
  if ( AmmBckgSemaphore == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : AMM BACKGROUND SEMAPHORE CREATION FAILED" );
    while(1);
  }
  
  AmmBckgTaskId = osThreadNew( AMM_Background_Task, NULL, &stAmmBckgTaskAttributes );
  if ( AmmBckgTaskId == NULL )
  { 
    APP_DBG( "ERROR FREERTOS :  AMM BACKGROUND TASK CREATION FAILED" );
    while(1);
  }
  
  CRCCTRL_Init();


  /* Register Semaphore to trigger FM_Background_Task */
  FlashMangerReqSemaphore = osSemaphoreNew( 1, 0, NULL );
  if ( FlashMangerReqSemaphore == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : FLASH MANAGER BACKGROUND SEMAPHORE CREATION FAILED" );
    Error_Handler();
  }

  /* Create flash manager Task over FreeRTOS */
  FmBackgroundTaskId = osThreadNew(FM_Background_Task, NULL, &stFlashManagerBackgroundTaskAttributes);
  if ( FmBackgroundTaskId == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : FLASH MANAGER BACKGROUND THREAD CREATION FAILED" );
    Error_Handler();
  }

  /* USER CODE BEGIN APPE_Init_1 */


  /* USER CODE END APPE_Init_1 */
  /* Create thread for BPKA and semaphore to control it*/
  BpkaSemaphore = osSemaphoreNew( 1, 0, NULL );
  if ( BpkaSemaphore == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : BPKA SEMAPHORE CREATION FAILED" );
    while(1);
  }

  BpkaTaskId = osThreadNew( BPKA_Task, NULL, &stBPKATaskAttributes );
  if ( BpkaTaskId == NULL )
  { 
    APP_DBG( "ERROR FREERTOS : BPKA TASK CREATION FAILED" );
    while(1);
  }



  BPKA_Reset( );

  RNG_Init();

  APP_DBG("Start init ble\n");
  APP_BLE_Init();
  
  /* create a SW timer to wakeup system from low power */
  UTIL_TIMER_Create(&TimerOSwakeup_Id,
                    0,
                    UTIL_TIMER_ONESHOT,
                    &TimerOSwakeupCB, 0);
  
  /* Disable RFTS Bypass for flash operation - Since LL has not started yet */
  FD_SetStatus (FD_FLASHACCESS_RFTS_BYPASS, LL_FLASH_DISABLE);

  ll_sys_config_params();
  
  /* USER CODE BEGIN APPE_Init_2 */
  /* USER CODE END APPE_Init_2 */
  APP_DEBUG_SIGNAL_RESET(APP_APPE_INIT);


  // Init nvm
  NM_Init();

#if (OTA_SUPPORT == 1)
#if (OTA_EXTERNAL_FLASH_ENABLE == 1)
  STM_OTA_SPI_FLASH_Init();
#else
  STM_OTA_FLASH_Init();
#endif /* (OTA_EXTERNAL_FLASH_ENABLE == 1) */
#endif /* (OTA_SUPPORT == 1) */

  APP_THREAD_Init();

#if (CONFIG_STM32_FACTORY_DATA_ENABLE == 1)
  /* Init PSA */
  psa_status_t retval;
   retval = psa_crypto_init();
  if(retval != PSA_SUCCESS)
  {
     APP_DBG("PSA Init Failed\n");
     Error_Handler();
  }
#endif /* CONFIG_STM32_FACTORY_DATA_ENABLE */

#if (CFG_LED_SUPPORTED == 1)
  APP_BSP_LedInit();
#endif /* (CFG_LED_SUPPORTED == 1) */
#if (CFG_JOYSTICK_SUPPORTED == 1)
  APP_BSP_JoystickInit();
#endif /* CFG_JOYSTICK_SUPPORTED */

  /* Init matter */
  APP_DBG("Start init matter\n");
  CHIP_ERROR err = GetAppTask().InitMatter();
  if (err != CHIP_NO_ERROR) {
      APP_DBG("Matter init failed\n");
  }

  GetAppTask().StartAppTask();

  return WPAN_SUCCESS;
}

/* USER CODE BEGIN FD */


/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/**
 * @brief Configure HSE by read this Tuning from OTP
 *
 */
static void Config_HSE(void)
{
  OTP_Data_s* otp_ptr = NULL;

  /* Read HSE_Tuning from OTP */
  if (OTP_Read(DEFAULT_OTP_IDX, &otp_ptr) != HAL_OK)
  {
    /* OTP no present in flash, apply default gain */
    HAL_RCCEx_HSESetTrimming(0x0C);
  }
  else
  {
    HAL_RCCEx_HSESetTrimming(otp_ptr->hsetune);
  }
}

/**
 *
 */
static void System_Init( void )
{

